In [1]:
import findspark

findspark.add_jars('/app/postgresql-42.1.4.jar')
findspark.init()

In [2]:
from pyspark.sql import SparkSession
import pandas as pd

spark = SparkSession.builder.appName("Henry:ETL").getOrCreate()

In [3]:
spark

In [4]:
import sys
from pyspark.sql import SparkSession

# UDF
from pyspark.sql.types import StringType
#
from pyspark.sql import functions as F
from pyspark.sql.window import Window

In [5]:
#Cargamos el primer dataset con pandas csv
df1 = pd.read_csv('/dataset/Dataset/precios_semana_20200413.csv', encoding='UTF-16')

In [184]:
#Verificamos si se cargo correctamente
print(df1.sample(5))
print(df1.dtypes)

        precio    producto_id sucursal_id
344944  139.00  7793620003591     10-1-25
259096  398.70  7791293034768   11-5-1020
283332  100.19  7791787000040    12-1-185
230046   94.90  7791130135832      50-1-2
169454  116.00  7790520019868     10-1-48
precio         float64
producto_id     object
sucursal_id     object
dtype: object

In [7]:
df1.isnull().sum()

precio         13
producto_id    15
sucursal_id    15
dtype: int64

In [8]:
#eliminamos los valores null

df1 = df1.dropna()

In [9]:
#Se define la funcion productos para normalizar los valos a 13 caracteres
def productos(valor):
    valor = str(valor)
    while (len(valor)) != 13:
        if len(valor) > 13:
            valor = valor[-13:]
            pass
        else:
            valor = "0"+valor
    
    return valor

In [10]:
#aplicacamos la funcion a la columna producto_id
df1['producto_id'] = df1['producto_id'].apply(productos)

In [11]:
df1.sample(20)

        precio    producto_id sucursal_id
178804   33.30  7790580110475   11-5-3613
217422   34.00  7790971002150    10-2-272
32309   223.85  0000000055423       6-1-9
252842  101.39  7791293028781   11-5-3602
350159   56.70  7793913000887   16-1-1302
459411  399.00  7898024396673      50-1-2
186552   65.00  7790580956608     13-1-97
66055    19.23  7622210813459      47-1-1
378521  209.00  7795293106531      49-1-2
358922   29.30  7794000960022    10-2-286
379613   36.90  7795323771883      50-1-2
333322  119.00  7793253017224     9-2-107
436645  295.00  7798176000308     10-1-29
85479    43.99  7790040118621   16-1-1402
264114   45.00  7791337001299    10-3-644
403918   39.90  7798063363899      49-1-2
425940   79.99  7798138553835      25-1-1
378428   89.90  7795293000198      50-1-2
100534  153.40  7790070320117       5-1-3
200571  262.95  7790770003990   16-1-2702

In [12]:
df2 = pd.read_json('/dataset/Dataset/precios_semana_20200503.json')

In [13]:
print(df2.head())
print(df2.dtypes)

   precio    producto_id sucursal_id
0    29.9  0000000002288     2-1-187
1    39.9  0000000002288     2-3-247
2  499.99  0000000205870     9-1-685
3  539.99  0000000205870      9-2-22
4  519.99  0000000205870      9-2-59
precio         object
producto_id    object
sucursal_id    object
dtype: object

In [60]:
df2.isna().sum()

precio         0
producto_id    0
sucursal_id    0
dtype: int64

In [94]:
df2.sample(20)

        precio    producto_id sucursal_id
264197     205  7792710000106       1-1-7
164512   183.9  7790740507909       5-1-5
53535      190  7613036402927     10-1-53
195195     149  7791130146791    13-1-120
242872    37.9  7791843003367      49-1-2
123580      40  7790360966193     9-1-194
310420      99  7794529040540     13-1-52
311026          7794612101493    65-1-317
27515      550  0000000011185       6-2-1
266281     158  7792798006199     10-1-26
90264      119  7790072000079    10-1-235
381335     102  7891079012499     10-1-53
348452    11.9  7798092964128      50-1-2
128022  111.25  7790411000500      20-1-1
393228   51.99  8480017042996    15-1-543
52090     1226  7613035010185    9-3-5218
349152     190  7798096051251    10-1-235
246858   56.99  7791905023067     36-6-40
83830    51.95  7790070318374       6-2-1
309002  1923.9  7794450091376    12-1-185

In [95]:
df2['producto_id'] = df2['producto_id'].apply(productos)

In [96]:
def vacios(x):
    if x == '':
        x = 0
    else:
        pass
    return x

In [100]:
df2['precio'] = df2['precio'].apply(vacios)

precio                     0
producto_id    7794612101493
sucursal_id         65-1-317
Name: 311026, dtype: object

In [ ]:
df2['precio'] = df2['precio'].

In [16]:
df2.sample(5)

        precio    producto_id sucursal_id
96822   105.65  7790127784497      6-1-17
85701       62  7790070410603   16-1-1502
201275    31.9  7791274002458      49-1-2
286363     149  7793360004254      49-1-2
194507   79.99  7791130029414      25-1-1

In [17]:
df4 = pd.read_csv('/dataset/Dataset/precios_semanas_20200419_20200419.csv')

In [18]:
print(df4.isna().sum())
print(df4.head())

precio         1807
sucursal_id       0
producto_id       0
dtype: int64
   precio sucursal_id producto_id
0   29.90     2-1-184        2288
1   39.90     2-1-206        2288
2  499.99     9-1-430      205870
3  539.99     9-2-107      205870
4  539.99  03/09/5218      205870

In [19]:
df4 = df4.dropna()

In [20]:
def sucursal(dato):
    dato = dato.replace('/','-')
    return dato

In [21]:
df4['sucursal_id'] = df4['sucursal_id'].apply(sucursal)

In [22]:
df4['producto_id'] = df4['producto_id'].apply(productos)

In [133]:
df4.describe()

             precio
count  4.567360e+05
mean   2.364533e+12
std    2.977930e+14
min    2.200000e-01
25%    6.700000e+01
50%    1.190000e+02
75%    2.139900e+02
max    4.399890e+16

In [134]:
df4.head()

   precio sucursal_id    producto_id
0   29.90     2-1-184  0000000002288
1   39.90     2-1-206  0000000002288
2  499.99     9-1-430  0000000205870
3  539.99     9-2-107  0000000205870
4  539.99  03-09-5218  0000000205870

In [24]:
df5 = pd.read_csv('/dataset/Dataset/precios_semanas_20200426_20200426.csv')

In [25]:
print(df5.isna().sum())
print(df5.head())
print(df5.dtypes)

precio          1736
sucursal_id        0
producto_id    13519
dtype: int64
    precio sucursal_id  producto_id
0    399.0     2-1-092       2288.0
1    299.0     2-1-206       2288.0
2    399.0     2-2-241       2288.0
3  49999.0     9-1-430     205870.0
4  53999.0       9-2-4     205870.0
precio         float64
sucursal_id     object
producto_id    float64
dtype: object

In [137]:
df5 = df5.dropna()
df5['precio'].max()

3441715.0

In [27]:
def decimal(num):
    num = str(num)
    num = num.replace('.0','')
    return num

In [28]:
df5['producto_id'] = df5['producto_id'].apply(decimal)

In [29]:
df5.head(5)

    precio sucursal_id producto_id
0    399.0     2-1-092        2288
1    299.0     2-1-206        2288
2    399.0     2-2-241        2288
3  49999.0     9-1-430      205870
4  53999.0       9-2-4      205870

In [30]:
df5['sucursal_id'] = df5['sucursal_id'].apply(sucursal)

In [31]:
df5['producto_id'] = df5['producto_id'].apply(productos)

In [32]:
df5.head()

    precio sucursal_id    producto_id
0    399.0     2-1-092  0000000002288
1    299.0     2-1-206  0000000002288
2    399.0     2-2-241  0000000002288
3  49999.0     9-1-430  0000000205870
4  53999.0       9-2-4  0000000205870

In [164]:
df6 = pd.read_parquet('/dataset/Dataset/producto.parquet', engine='pyarrow')

In [165]:
df6.dtypes

id              object
marca           object
nombre          object
presentacion    object
categoria1      object
categoria2      object
categoria3      object
dtype: object

In [166]:
df6.sample(5)

,id,marca,nombre,presentacion,categoria1,categoria2,categoria3
70175,9-1-0000000257398,SIN MARCA,Queso y Dulce en Sobre 1 Kg,1.0 kg,None,None,None
55786,7798061000376,INCA,Jugo en Polvo Limon Inca 20 Gr,20.0 gr,None,None,None
25300,7790520020826,LYSOFORM,Disco Adhesivo Inodoro Lavanda Full Lysoform 3...,38.0 gr,None,None,None
54889,7798045214003,KOSIUKO,Perfume Kosiuko California Valley 100 Ml,100.0 ml,None,None,None
40772,7792354001958,MARENGO,Caramelos Masticables Marengo 500 Gr,500.0 gr,None,None,None

In [160]:
df6['id'] = df6['id'].apply(productos)

In [168]:

print(df6.isnull().sum())
print(df6.isna().sum())
print('Cantidad de Id: ',df6['id'].count())
print('Id Distintos ',len(df6['id'].unique()))

id                  0
marca               2
nombre              2
presentacion        2
categoria1      72034
categoria2      72034
categoria3      72034
dtype: int64
id                  0
marca               2
nombre              2
presentacion        2
categoria1      72034
categoria2      72034
categoria3      72034
dtype: int64
Cantidad de Id:  72038
Id Distintos  72038

In [172]:
df6 = df6.rename(columns={'id':'sucursal_id'})

AttributeError: 'function' object has no attribute 'dropna'

In [173]:
df6.sample(3)

,sucursal_id,marca,nombre,presentacion,categoria1,categoria2,categoria3
19571,7790080013610,SANCOR,Queso Reggianito Corazon de Horma Sancor 230 Gr,230.0 gr,None,None,None
25092,7790520011831,MR MÚSCULO,Limpiador de Vidrio Multiuso Formula Activa Do...,450.0 cc,None,None,None
49712,7795323002574,NUTRILÓN,Leche Nutrilon 4 Profutura 1 Lt,1.0 lt,None,None,None

In [153]:
df6.isnull().sum()

AttributeError: 'function' object has no attribute 'isnull'

In [40]:
(df6.drop_duplicates)

<bound method DataFrame.drop_duplicates of                   id        marca  \
0      0000000001663   LA ANÓNIMA
1      0000000002288   LA ANÓNIMA
2      0000000205870    SIN MARCA
3      0000000205894    SIN MARCA
4      0000000205955    SIN MARCA
...              ...          ...
72033  9569753142128  DELI-SITAS
72034  9795403001143         MAYO
72035  9990385651922         DANA
72036  9990385651939         DANA
72037  9990385651946         DANA

                                                  nombre presentacion  \
0                        Radicheta Atada La Anonima 1 Un       1.0 un
1                          Perejil Atado La Anonima 1 Un       1.0 un
2                                       Ojo de Bife 1 Kg       1.0 kg
3                      Milanesa de Peceto Novillito 1 Kg       1.0 kg
4                             Chiquizuela Novillito 1 Kg       1.0 kg
...                                                  ...          ...
72033  Milhojas Cobertura de Chocolate Blanco Deli-Si...     500.0 gr
72034                           Mini Pizzetas Mayo 12 Un      12.0 un
72035                 Te Negro en Hebras Lata Dana 50 Gr      50.0 gr
72036                 Te Verde en Hebras Lata Dana 50 Gr      50.0 gr
72037            Yerba Mate Aromatizada Lata Dana 150 Gr     150.0 gr

      categoria1 categoria2 categoria3
0           None       None       None
1           None       None       None
2           None       None       None
3           None       None       None
4           None       None       None
...          ...        ...        ...
72033       None       None       None
72034       None       None       None
72035       None       None       None
72036       None       None       None
72037       None       None       None

[72038 rows x 7 columns]>

In [41]:
df7 = pd.read_csv('/dataset/Dataset/sucursal.csv')

In [42]:
df7.dtypes

id                      object
comercioId               int64
banderaId                int64
banderaDescripcion      object
comercioRazonSocial     object
provincia               object
localidad               object
direccion               object
lat                    float64
lng                    float64
sucursalNombre          object
sucursalTipo            object
dtype: object

In [43]:
df7.sample(10)

,id,comercioId,banderaId,banderaDescripcion,comercioRazonSocial,provincia,localidad,direccion,lat,lng,sucursalNombre,sucursalTipo
1609,2-1-008,2,1,La Anonima,S.A. Importadora y Exportadora de la Patagonia,AR-R,San Carlos de Bariloche,Gdor.Quaglia 311,-41.135450,-71.308740,BARILOCHE,Supermercado
1096,15-1-1802,15,1,Supermercados DIA,DIA Argentina S.A,AR-A,Salta,Av Jose Contreras 0,-24.811541,-65.426427,1802 - Salta,Supermercado
2140,9-1-51,9,1,Vea,Jumbo Retail Argentina S.A.,AR-B,NECOCHEA,Av. 59 Esq. Calle 38 1660,-38.561100,-58.730500,NECOCHEA,Supermercado
2021,7-1-40,7,1,Supermercados Cordiez,Cyre S.A.,AR-X,CORDOBA,Av. Velez Sarsfield 334,-31.419003,-64.188666,Cordiez 40,Supermercado
501,10-3-657,10,3,Express,INC S.A.,AR-C,Ciudad Autónoma de Buenos Aires,Montiel 1718,-34.657114,-58.518180,Montiel 1718,Autoservicio
707,12-1-204,12,1,COTO CICSA,Coto Centro Integral de Comercialización S.A.,AR-B,General Lavalle,Ruta 11 Km 330,-36.582166,-56.714637,MAR DEL TUYU,Hipermercado
1145,15-1-238,15,1,Supermercados DIA,DIA Argentina S.A,AR-C,Capital Federal,Av Rivadavia 872,-34.639169,-58.517101,238 - Liniers,Autoservicio
71,10-1-47,10,1,Hipermercado Carrefour,INC S.A.,AR-B,Martín Coronado,Av. Pdte. J. D. Perón 7055,-34.587243,-58.593697,Martín Coronado,Hipermercado
2221,9-1-943,9,1,Vea,Jumbo Retail Argentina S.A.,AR-E,PARANA,Avenida Almafuerte Prolong 1670,-31.755100,-60.499300,Paraná,Hipermercado
2086,9-1-187,9,1,Vea,Jumbo Retail Argentina S.A.,AR-M,MAIPU,Vasquez Padre 328,-32.982400,-68.788300,Vea 20.,Supermercado

In [44]:
df3 = pd.read_csv('/dataset/Dataset/precios_semana_20200518.txt',header=[0],sep='|' )

In [45]:
df3 = df3.dropna()

In [46]:
df3['producto_id'] = df3['producto_id'].apply(productos)

In [140]:
df3['precio'].max()

35900.0

In [141]:
df3.describe()

              precio
count  413331.000000
mean      185.769702
std       376.164471
min         0.350000
25%        67.000000
50%       119.000000
75%       214.500000
max     35900.000000

In [143]:
df8.sample(5)

        precio    producto_id sucursal_id
290005   56.90  7793253001407      46-1-3
84213   159.95  7790070033154    16-1-702
176247  177.00  7790773018229      10-1-9
60240    41.40  7622300829629    10-3-463
386750   62.00  7798187760154     10-1-48

In [174]:
sparkDF1=spark.createDataFrame(df6) 
sparkDF1.printSchema()

root
 |-- sucursal_id: string (nullable = true)
 |-- marca: string (nullable = true)
 |-- nombre: string (nullable = true)
 |-- presentacion: string (nullable = true)
 |-- categoria1: string (nullable = true)
 |-- categoria2: string (nullable = true)
 |-- categoria3: string (nullable = true)

In [175]:
sparkDF2=spark.createDataFrame(df7) 
sparkDF2.printSchema()

root
 |-- id: string (nullable = true)
 |-- comercioId: long (nullable = true)
 |-- banderaId: long (nullable = true)
 |-- banderaDescripcion: string (nullable = true)
 |-- comercioRazonSocial: string (nullable = true)
 |-- provincia: string (nullable = true)
 |-- localidad: string (nullable = true)
 |-- direccion: string (nullable = true)
 |-- lat: double (nullable = true)
 |-- lng: double (nullable = true)
 |-- sucursalNombre: string (nullable = true)
 |-- sucursalTipo: string (nullable = true)

In [130]:
sparkDF=spark.createDataFrame(df8)

In [131]:
sparkDF.printSchema()

root
 |-- precio: double (nullable = true)
 |-- producto_id: string (nullable = true)
 |-- sucursal_id: string (nullable = true)

In [132]:
sparkDF.select("precio", "producto_id", "sucursal_id") \
    .write \
    .format("jdbc") \
    .option("url", "jdbc:postgresql://postgres/henry") \
    .option("dbtable", "precios3") \
    .option("user", "matias") \
    .option("password", "matias") \
    .option("driver", "org.postgresql.Driver") \
    .mode('append') \
    .save()

In [176]:
sparkDF1 \
    .write \
    .format("jdbc") \
    .option("url", "jdbc:postgresql://postgres/henry") \
    .option("dbtable", "productos") \
    .option("user", "matias") \
    .option("password", "matias") \
    .option("driver", "org.postgresql.Driver") \
    .mode('append') \
    .save()

In [177]:
sparkDF2 \
    .write \
    .format("jdbc") \
    .option("url", "jdbc:postgresql://postgres/henry") \
    .option("dbtable", "sucursales") \
    .option("user", "matias") \
    .option("password", "matias") \
    .option("driver", "org.postgresql.Driver") \
    .mode('append') \
    .save()